Revit 2026 API

# BentFabricBendDirection Enumeration

---

Direction in which FabricSheet is bent.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BentFabricBendDirection
```
```vb
Public Enumeration BentFabricBendDirection
```
```cpp
public enum class BentFabricBendDirection
```
```fsharp
type BentFabricBendDirection
```

| Member name | Value | Description |
| --- | --- | --- |
| Major | 0 | FabricSheet is bent along major direction axis. |
| Minor | 1 | FabricSheet is bent along minor direction axis. |

#### Reference

Autodesk.Revit.DB.Structure Namespace